---
title: KeyBasedTreeEntriesLoadResults
classe: Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# KeyBasedTreeEntriesLoadResults

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `keyBasedTreeEntriesLoadResults.IsValidObject` | Boolean |
| `Void Dispose()` | `keyBasedTreeEntriesLoadResults.Dispose()` | Void |
| `IList<FailureMessage> GetFailureMessages()` | `keyBasedTreeEntriesLoadResults.GetFailureMessages()` | IList<FailureMessage> |
| `IList<String> GetFileReadErrors()` | `keyBasedTreeEntriesLoadResults.GetFileReadErrors()` | IList<String> |
| `IList<String> GetFileSyntaxErrors()` | `keyBasedTreeEntriesLoadResults.GetFileSyntaxErrors()` | IList<String> |
| `IList<KeyBasedTreeEntryError> GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType)` | `keyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors(type)` | IList<KeyBasedTreeEntryError> |
| `IList<KeyBasedTreeEntryError> GetKeyBasedTreeEntryErrors()` | `keyBasedTreeEntriesLoadResults.GetKeyBasedTreeEntryErrors()` | IList<KeyBasedTreeEntryError> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```